[scan de port horizontal]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://127.0.0.1:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */15 * * * *
disabled = 1
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path","data.dst.ip","data.src.ip","data.src.port","data.dst.port"]
display.events.type = table
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test | bin _time span=1m   | stats  dc(data.dst.ip) AS unique_dest_count values(data.dst.ip) AS dests by data.src.ip, data.dst.port, _time   | where  unique_dest_count > 50

[AD - Détection AS-REP Roasting]
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Détection de multiples échecs de pré-authentification Kerberos (4768, code 0x18) typiques d'une attaque AS-REP Roasting.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Security" EventCode=4768 Failure_Code=0x18\
| where NOT like(Account_Name,"%$")\
| stats count by Account_Name, Client_Address\
| where count > 5

[AD - Détection Shadow Credentials]
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Détection d'une modification du champ msDS-KeyCredentialLink, indicateur d'implantation de Shadow Credentials.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Directory Service" EventCode=5136\
| search AttributeLDAPDisplayName="msDS-KeyCredentialLink"\
| stats values(AttributeValue) as new_value by Account_Name, ObjectDN

[AD - Détection Password Spraying]
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Détection d'échecs de connexion nombreux (4625) provenant d'une même IP sur plusieurs comptes, typique d'un Password Spraying.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Security" EventCode=4625\
| where NOT like(Account_Name,"%$")\
| stats dc(Account_Name) as nb_users count as nb_echecs by Client_Address\
| where nb_users > 5 AND nb_echecs > 20

[Accès à /etc/shadow détecté]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://127.0.0.1:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
disabled = 1
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path"]
display.events.type = table
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test "data.command_line"="*/etc/shadow*"

[AD - Détection Kerberoasting]
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
description = Détection d’un nombre anormal de tickets Kerberos (4769) chiffrés en RC4 par un compte non-machine. Indicateur classique d’une tentative de Kerberoasting.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Security" EventCode=4769\
| where Ticket_Encryption_Type="0x17" OR Ticket_Encryption_Type="0x12"\
| stats count by Account_Name, Service_Name, IpAddress

[scan de port vertical]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://127.0.0.1:5678/webhook-test/alert
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */2 * * * *
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path","data.dst.ip","data.src.ip","data.src.port","data.dst.port"]
display.events.type = table
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test\
| bin _time span=1m\
| stats dc(data.dst.port) AS unique_port_count values(data.dst.port) AS ports_contacted by data.src.ip, data.dst.ip, _time\
| where unique_port_count > 50\
| sort - _time\
| table _time, data.src.ip, data.dst.ip, unique_port_count, ports_contacted

[Kerberoasting]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
description = Détecte les demandes de tickets Kerberos (Event 4769) vers des comptes de service, en excluant krbtgt. Ce comportement est typique d’une tentative de Kerberoasting.
dispatch.earliest_time = rt
dispatch.latest_time = rt
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test EventCode=4769\
| where NOT like(Service_Name,"krbtgt%")

[Suspicious System Reconnaissance Commands Detected]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = A Windows user executed reconnaissance commands such as systeminfo, whoami, hostname or quser. \
These commands are commonly used by attackers during the discovery phase to collect information about the system and logged-in users.
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_processus"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test source="WinEventLog:Security" EventCode=4688\
(\
    Nom_du_processus="*SYSTEMINFO.EXE"\
    OR Nom_du_processus="*QUSER.EXE"\
    OR Nom_du_processus="*WHOAMI.EXE"\
    OR Nom_du_processus="*HOSTNAME.EXE"\
    OR Nom_du_nouveau_processus="*SYSTEMINFO.EXE"\
    OR Nom_du_nouveau_processus="*QUSER.EXE"\
    OR Nom_du_nouveau_processus="*WHOAMI.EXE"\
    OR Nom_du_nouveau_processus="*HOSTNAME.EXE"\
)\
| stats count min(_time) as firstTime max(_time) as lastTime \
        values(Nom_du_processus) as Process\
        values(Nom_du_nouveau_processus) as NewProcess\
        values(Nom_du_compte) as User\
        values(Domaine_du_compte) as Domain\
        by host\
| eval alert_severity_id=1\
| eval firstTime=strftime(firstTime,"%Y-%m-%d %H:%M:%S"), \
       lastTime=strftime(lastTime,"%Y-%m-%d %H:%M:%S")

[Modification clé Run – Persistance possible]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
description = Détection des créations, modifications ou suppressions dans les clés Run (HKLM/HKCU) qui peuvent être utilisées pour la persistance malveillante.
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=13 \
(TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*")\
| where User!="NT AUTHORITY\SYSTEM"\
| eval Action=case(\
    match(Details,"Value added"), "Created",\
    match(Details,"Value overwritten|Value modified"), "Modified",\
    true(), "Other"\
)\
| eval alert_severity_id=1\
| table _time, ComputerName, User, TargetObject, Action, Details

[Detection: Internal Horizontal Port Scan NMAP Top 20]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = * * * * *
description = This analytic identifies instances where an internal host has attempted to communicate with 250 or more destination IP addresses using on of the NMAP top 20 ports. Horizontal port scans from internal hosts can indicate reconnaissance or scanning activities, potentially signaling malicious intent or misconfiguration. By monitoring network traffic logs, this detection helps detect and respond to such behavior promptly, enhancing network security and preventing potential threats.
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_processus"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=kunai_json\
data.socket.proto="TCP"\
data.src.ip IN ("10.*", "172.16.*", "192.168.*")\
data.dst.port IN (21,22,23,25,53,80,110,111,135,139,143,443,445,993,995,1723,3306,3389,5900,8080)\
| stats \
    dc(data.dst.ip) as totalDestIPCount\
    values(data.dst.ip) as destIPs\
    values(data.dst.port) as destPorts\
    values(task.name) as processes\
    min(_time) as firstSeen\
    max(_time) as lastSeen\
  by data.src.ip data.dst.port\
| where totalDestIPCount >= 250\
| eval alert_severity_id=5\
| eval firstSeen=strftime(firstSeen,"%Y-%m-%d %H:%M:%S"),\
       lastSeen=strftime(lastSeen,"%Y-%m-%d %H:%M:%S")

[Détection création de service suspect]
action.list = 1
action.list.severity = 4
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.severity = 4
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Détecte l’utilisation de sc.exe pour créer ou configurer un service Windows (MITRE T1543.003).
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational\
EventCode=1\
Image="*\\sc.exe"\
(CommandLine="* create *" OR CommandLine="* config *")\
NOT (ParentImage="*\\svchost.exe" AND ParentCommandLine="*Schedule*")\
| eval alert_severity_id=5

[CnC:Windows Curl Download to Suspicious Path]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
description = The following analytic detects the use of Windows Curl.exe to download a file to a suspicious location, such as AppData, ProgramData, or Public directories. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions that include the -O or --output options. This activity is significant because downloading files to these locations can indicate an attempt to bypass security controls or establish persistence. If confirmed malicious, this behavior could lead to unauthorized code execution, data exfiltration, or further compromise of the system.
dispatch.earliest_time = -70m@m
dispatch.latest_time = -10m@m
display.events.fields = ["host","source","sourcetype","Nom_du_processus","data.dst.ip","data.dst.port"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test source="WinEventLog:Microsoft-Windows-Sysmon/Operational"\
(\
    EventCode=1 OR EventCode=11\
)\
Image="C:\\Windows\\System32\\curl.exe"\
(\
    CommandLine="*-o *" OR \
    CommandLine="*--output*" OR \
    CommandLine="*--output-dir*"\
)\
(\
    CommandLine="*\\Windows\\Temp\\*" OR\
    CommandLine="*\\Users\\Public\\*" OR\
    CommandLine="*\\ProgramData\\*" OR\
    CommandLine="*\\AppData\\*" OR\
    CommandLine="*\\PerfLogs\\*"\
    OR TargetFilename="*\\Windows\\Temp\\*"\
    OR TargetFilename="*\\Users\\Public\\*"\
    OR TargetFilename="*\\ProgramData\\*"\
    OR TargetFilename="*\\AppData\\*"\
    OR TargetFilename="*\\PerfLogs\\*"\
)\
| table _time Image CommandLine TargetFilename User ParentCommandLine ParentImage

[Detection planified schtasks]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = cration de tache plannifiée
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational (EventCode=1 OR EventCode=13) (Image="*\\schtasks.exe" OR CommandLine="*schtasks*")\
| eval alert_severity_id=5

[detection_planified_schtasks]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 60m
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = cration de tache plannifiée
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational (EventCode=1 OR EventCode=13) (Image="*\\schtasks.exe" OR CommandLine="*schtasks*")\
| eval alert_severity_id=1

[test n8n]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 4
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
description = test from n8n
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path"]
display.events.type = table
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test "*tailscale*" \
| eval alert_severity_id=3

[Multiples commandes d'énumération]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://127.0.0.1:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 2
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */2 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path","data.dst.ip","data.src.ip","data.src.port","data.dst.port"]
display.events.type = table
display.general.type = statistics
display.page.search.tab = statistics
display.statistics.drilldown = row
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype="kunai_json" \
(data.command_line="*uname -a*" OR data.command_line="*whoami*" OR data.command_line="id" OR data.command_line="*ps aux*" OR data.command_line="*netstat -an*" OR data.command_line="*ss -tunlp*" OR data.command_line="*ip a*" OR data.command_line="*ls /home*" OR data.command_line="*cat /etc/passwd*")\
| eval alert_severity_id=4\
| stats count, values(data.command_line) as list_cmd_line by host, info.task.user
