[scan de port horizontal]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://127.0.0.1:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */15 * * * *
disabled = 1
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path","data.dst.ip","data.src.ip","data.src.port","data.dst.port"]
display.events.type = table
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test | bin _time span=1m   | stats  dc(data.dst.ip) AS unique_dest_count values(data.dst.ip) AS dests by data.src.ip, data.dst.port, _time   | where  unique_dest_count > 50

[test n8n]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 1
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
description = test from n8n
disabled = 1
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path"]
display.events.type = table
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype="kunai_json"  \
| eval alert_severity_id=3

[Kerberoasting]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 5
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
description = Détecte les demandes de tickets Kerberos (Event 4769) vers des comptes de service, en excluant krbtgt. Ce comportement est typique d’une tentative de Kerberoasting.
dispatch.earliest_time = rt
dispatch.latest_time = rt
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test EventCode=4769\
| where NOT like(Service_Name,"krbtgt%")\
|eval alert_severity_id=6

[scan de port vertical]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */2 * * * *
description = Détecte les machines effectuant un scan de ports vertical en se connectant à de nombreux ports sur la même cible.
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path","data.dst.ip","data.src.ip","data.src.port","data.dst.port"]
display.events.type = table
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test\
| bin _time span=1m\
| stats dc(data.dst.port) AS unique_port_count values(data.dst.port) AS ports_contacted by data.src.ip, data.dst.ip, _time\
| where unique_port_count > 50\
| eval alert_severity_id=1 , event_time=_time\
| sort - _time

[AD - Détection AS-REP Roasting]
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Détection de multiples échecs de pré-authentification Kerberos (4768, code 0x18) typiques d'une attaque AS-REP Roasting.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Security" EventCode=4768 Failure_Code=0x18\
| where NOT like(Account_Name,"%$")\
| stats count by Account_Name, Client_Address\
| where count > 5

[AD - Détection Kerberoasting]
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
description = Détection d’un nombre anormal de tickets Kerberos (4769) chiffrés en RC4 par un compte non-machine. Indicateur classique d’une tentative de Kerberoasting.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Security" EventCode=4769\
| where Ticket_Encryption_Type="0x17" OR Ticket_Encryption_Type="0x12"\
| stats count by Account_Name, Service_Name, IpAddress\
|eval alert_severity_id=1

[AD - Détection Password Spraying]
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Détection d'échecs de connexion nombreux (4625) provenant d'une même IP sur plusieurs comptes, typique d'un Password Spraying.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Security" EventCode=4625\
| where NOT like(Account_Name,"%$")\
| stats dc(Account_Name) as nb_users count as nb_echecs by Client_Address\
| where nb_users > 5 AND nb_echecs > 20

[AD - Détection Shadow Credentials]
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Détection d'une modification du champ msDS-KeyCredentialLink, indicateur d'implantation de Shadow Credentials.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=wineventlog sourcetype="WinEventLog:Directory Service" EventCode=5136\
| search AttributeLDAPDisplayName="msDS-KeyCredentialLink"\
| stats values(AttributeValue) as new_value by Account_Name, ObjectDN

[Dump LSASS (MiniDump / Procdump / ProcessAccess)]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.expires = 24d
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Détection LSASS
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* (sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="WinEventLog:*")\
(\
    (\
        EventCode=1 AND Image="*\\rundll32.exe" AND CommandLine="*comsvcs.dll*MiniDump*"\
    )\
    OR\
    (\
        EventCode=1 AND Image="*procdump*.exe" AND CommandLine="*-ma*" AND CommandLine="*lsass*"\
    )\
    OR\
    (\
        EventCode=1 AND Image="*\\taskmgr.exe" AND CommandLine="*lsass*"\
    )\
    OR\
    (\
        EventCode=1 AND Image="*processhacker*"\
    )\
    OR\
    (\
        EventCode=10 AND TargetImage="*lsass.exe*" AND NOT Image="*\\lsass.exe"\
    )\
) | eval alert_severity_id=6

[Détection création de service suspect]
action.list = 1
action.list.severity = 4
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 4
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Détecte l’utilisation de sc.exe pour créer ou configurer un service Windows (MITRE T1543.003).
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational\
EventCode=1\
Image="*\\sc.exe"\
(CommandLine="* create *" OR CommandLine="* config *")\
NOT (ParentImage="*\\svchost.exe" AND ParentCommandLine="*Schedule*")\
| eval alert_severity_id=5

[detection_planified_schtasks]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 60d
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = cration de tache plannifiée
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational (EventCode=1 OR EventCode=13) (Image="*\\schtasks.exe" OR CommandLine="*schtasks*")\
| eval alert_severity_id=1

[Accès à /etc/shadow détecté]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = false
alert.expires = 24d
alert.suppress = false
alert.suppress.period = 60s
alert.track = true
cron_schedule = * * * * *
disabled = 1
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path"]
display.events.type = table
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test "data.command_line"="*/etc/shadow*"

[Detection planified schtasks]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */3 * * * *
description = cration de tache plannifiée
dispatch.earliest_time = -3m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational (EventCode=1 OR EventCode=13) (Image="*\\schtasks.exe" OR CommandLine="*schtasks*")\
| eval alert_severity_id=5

[CnC:Windows Curl Download to Suspicious Path]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 4
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = The following analytic detects the use of Windows Curl.exe to download a file to a suspicious location, such as AppData, ProgramData, or Public directories. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions that include the -O or --output options. This activity is significant because downloading files to these locations can indicate an attempt to bypass security controls or establish persistence. If confirmed malicious, this behavior could lead to unauthorized code execution, data exfiltration, or further compromise of the system.
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","Nom_du_processus","data.dst.ip","data.dst.port"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test source="WinEventLog:Microsoft-Windows-Sysmon/Operational"\
(\
    EventCode=1 OR EventCode=11\
)\
Image="C:\\Windows\\System32\\curl.exe"\
(\
    CommandLine="*-o *" OR \
    CommandLine="*--output*" OR \
    CommandLine="*--output-dir*"\
)\
(\
    CommandLine="*\\Windows\\Temp\\*" OR\
    CommandLine="*\\Users\\Public\\*" OR\
    CommandLine="*\\ProgramData\\*" OR\
    CommandLine="*\\AppData\\*" OR\
    CommandLine="*\\PerfLogs\\*"\
    OR TargetFilename="*\\Windows\\Temp\\*"\
    OR TargetFilename="*\\Users\\Public\\*"\
    OR TargetFilename="*\\ProgramData\\*"\
    OR TargetFilename="*\\AppData\\*"\
    OR TargetFilename="*\\PerfLogs\\*"\
)\
|eval alert_severity_id=5

[Modification clé Run – Persistance possible]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 1
cron_schedule = * * * * *
description = Détection des créations, modifications ou suppressions dans les clés Run (HKLM/HKCU) qui peuvent être utilisées pour la persistance malveillante.
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype="WinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=13 \
(TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*")\
| where User!="NT AUTHORITY\SYSTEM"\
| eval Action=case(\
    match(Details,"Value added"), "Created",\
    match(Details,"Value overwritten|Value modified"), "Modified",\
    true(), "Other"\
)\
| eval alert_severity_id=1

[Suspicious System Reconnaissance Commands Detected]
action.list = 1
action.list.severity = 3
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 4
alert.suppress = 0
alert.suppress.period = 60s
alert.track = 1
cron_schedule = * * * * *
description = A Windows user executed reconnaissance commands such as systeminfo, whoami, hostname or quser. \
These commands are commonly used by attackers during the discovery phase to collect information about the system and logged-in users.
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.events.fields = ["host","source","sourcetype","Nom_du_processus"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test source="WinEventLog:Security" EventCode=4688\
(\
    Nom_du_processus="*SYSTEMINFO.EXE"\
    OR Nom_du_processus="*QUSER.EXE"\
    OR Nom_du_processus="*WHOAMI.EXE"\
    OR Nom_du_processus="*HOSTNAME.EXE"\
    OR Nom_du_nouveau_processus="*SYSTEMINFO.EXE"\
    OR Nom_du_nouveau_processus="*QUSER.EXE"\
    OR Nom_du_nouveau_processus="*WHOAMI.EXE"\
    OR Nom_du_nouveau_processus="*HOSTNAME.EXE"\
)\
| stats count min(_time) as firstTime max(_time) as lastTime \
        values(Nom_du_processus) as Process\
        values(Nom_du_nouveau_processus) as NewProcess\
        values(Nom_du_compte) as User\
        values(Domaine_du_compte) as Domain\
        by host\
| eval alert_severity_id=1\
| eval firstTime=strftime(firstTime,"%Y-%m-%d %H:%M:%S"), \
       lastTime=strftime(lastTime,"%Y-%m-%d %H:%M:%S")\
|eval alert_severity_id=5

[Detection: Internal Horizontal Port Scan NMAP Top 20]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 4
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
description = This analytic identifies instances where an internal host has attempted to communicate with 250 or more destination IP addresses using on of the NMAP top 20 ports. Horizontal port scans from internal hosts can indicate reconnaissance or scanning activities, potentially signaling malicious intent or misconfiguration. By monitoring network traffic logs, this detection helps detect and respond to such behavior promptly, enhancing network security and preventing potential threats.
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.events.fields = ["host","source","sourcetype","Nom_du_processus"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=kunai_json\
data.socket.proto="TCP"\
data.src.ip IN ("10.*", "172.16.*", "192.168.*")\
data.dst.port IN (21,22,23,25,53,80,110,111,135,139,143,443,445,993,995,1723,3306,3389,5900,8080)\
| stats \
    dc(data.dst.ip) as totalDestIPCount\
    values(data.dst.ip) as destIPs\
    values(data.dst.port) as destPorts\
    values(task.name) as processes\
    min(_time) as firstSeen\
    max(_time) as lastSeen\
  by data.src.ip data.dst.port\
| where totalDestIPCount >= 250\
| eval alert_severity_id=5\
| eval firstSeen=strftime(firstSeen,"%Y-%m-%d %H:%M:%S"),\
       lastSeen=strftime(lastSeen,"%Y-%m-%d %H:%M:%S")\
| eval alert_severity_id=5

[AS-REP Roasting]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
description = Cette requête Splunk est conçue pour détecter les événements AS-REP Roasting, c’est-à-dire les tentatives d’authentification Kerberos pour des comptes configurés “Do not require Kerberos pre-authentication”
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test sourcetype=XmlWinEventLog EventCode=4768 EventData.PreAuthType=0\
| eval Account_Name=EventData.TargetUserName\
| eval Client_Address=EventData.IpAddress\
| table _time Account_Name Client_Address EventData.PreAuthType host\
| sort -_time

[Utilisation du LOLBIN]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook-test/alert
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
description = Utilisation du LOLBIN
dispatch.earliest_time = -2m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index="test" EventCode=1 source="WinEventLog:Microsoft-Windows-Sysmon/Operational"\
(\
    (Image="*mshta.exe" AND CommandLine="*javascript:*")\
    OR\
    (Image="*regsvr32.exe" AND CommandLine="*scrobj.dll*")\
    OR\
    (Image="*rundll32.exe" AND CommandLine="*url.dll,FileProtocolHandler*")\
    OR\
    (Image="*certutil.exe" AND (CommandLine="*-urlcache*" OR CommandLine="*-decode*" OR CommandLine="*-hashfile*"))\
    OR\
    (Image="*wmic.exe" AND (CommandLine="*process*" OR CommandLine="*os get*"))\
) | eval alert_severity_id=5

[AS-REP Roasting-AD(W)]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.suppress = 0
alert.track = 1
cron_schedule = * * * * *
dispatch.earliest_time = rt
dispatch.latest_time = rt
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* EventCode=4768 PreAuthType=0\
| stats \
    count AS attempts \
    values(TargetUserName) AS users \
    by IpAddress\
| eval detection="AS-REP Roasting brute force"\
| eval severity=if(attempts>3, "high", "medium")\
| table IpAddress attempts users detection severity

[AS‑REP Roasting othmane]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -2m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test EventCode=4768\
| where PreAuthType="-" OR PreAuthType="0"\
| where Status="0x6" OR Status="0x0"\
| where like(ServiceName, "krbtgt%")\
| stats count AS attempts, values(TargetUserName) AS users, values(IpAddress) AS sources BY IpAddress\
| where attempts >= 3\
| eval detection="AS-REP Roasting brute force", severity="high"

[AD test aymen]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -2m
dispatch.latest_time = now
display.page.search.mode = verbose
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=test EventCode=4768\
ServiceName="krbtgt"\
PreAuthType="2"\
Status="0x0"\
[ search index=test EventCode=4768\
  ServiceName="krbtgt"\
  PreAuthType="2"\
  Status="0x0"\
  | stats count as attempts by IpAddress\
  | where attempts >= 3\
  | fields IpAddress\
]

[Multiples commandes d'énumération]
action.webhook = 1
action.webhook.enable_allowlist = 0
action.webhook.param.url = http://soc_n8n:5678/webhook/alert
alert.digest_mode = 0
alert.expires = 24d
alert.severity = 2
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Détecte lorsqu’un utilisateur exécute plusieurs commandes typiques d’énumération.
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","info.task.user","data.command_line","data.parent_command_line","info.parent_task.user","data.path","data.exe.path","data.dst.ip","data.src.ip","data.src.port","data.dst.port"]
display.events.type = table
display.general.type = statistics
display.page.search.tab = statistics
display.statistics.drilldown = row
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = index=* sourcetype="kunai_json" \
(    data.command_line="*whoami*" OR\
    data.command_line="*id*" OR\
    data.command_line="*ps aux*" OR\
    data.command_line="*ip a*" OR\
    data.command_line="*ip addr*" OR\
    data.command_line="*ifconfig*" OR\
    data.command_line="*netstat*" OR\
    data.command_line="*ss -tuna*" OR\
    data.command_line="*ss -ltnp*" OR\
    data.command_line="*ls /etc*" OR\
    data.command_line="*ls /home*" OR\
    data.command_line="*cat /etc/passwd*" OR\
    data.command_line="*cat /etc/group*" OR\
    data.command_line="*hostnamectl*" OR\
    data.command_line="*lsblk*" OR\
    data.command_line="*df -h*" OR\
    data.command_line="*free -m*" OR\
    data.command_line="*uname -a*" OR\
    data.command_line="*uname -r*" OR\
    data.command_line="*last*" OR\
    data.command_line="*who*" OR\
    data.command_line="*w*" OR\
    data.command_line="*groups*" OR\
    data.command_line="*lsof*" OR\
    data.command_line="*journalctl*" OR\
    data.command_line="*dmesg*" OR\
    data.command_line="*crontab -l*" OR\
    data.command_line="*systemctl list-units*" OR\
    data.command_line="*sudo -l*" OR\
    data.command_line="*find / -maxdepth 1*" OR\
    data.command_line="*env*" OR\
    data.command_line="*printenv*")\
| eval alert_severity_id=4\
| rename info.task.user as User\
| stats count as nb_execution, values(data.command_line) as list_cmd_line, min(info.utc_time) as event_time, max(alert_severity_id) as alert_severity_id by host, User
