title: Suspicious Wget Usage with Quiet Mode and Output Redirection
id: pseudo-sigma-wget
status: experimental

logsource:
  product: linux
  service: kunai
  category: process_creation

detection:

  selection_task:
    info.task.name: "wget"

  selection_args:
    data.command_line|contains:
      - "-q"
      - "-O-"

  condition: selection_task and selection_args

fields:
  - info.task.name
  - info.parent_task.name
  - data.exe.path
  - data.command_line
  - data.dst.ip
  - data.dst.port
  - info.host.name
  - _time
