title: Password Looting Detection
id: pseudo-sigma-password-looting
status: experimental

logsource:
  product: linux
  service: kunai
  category: process_creation

detection:
  selection_cmds:
    data.command_line|contains:
      - "cat /etc/shadow"
      - "unshadow"
      - "john"
      - "hashcat"
      - "openssl passwd"
      - "pam_unix"

  condition: selection_cmds

fields:
  - data.command_line
  - info.host.name
  - info.task.user
  - _time
