title: Suspicious Schtasks Usage (Process Creation or Registry Modification)
id: pseudo-sigma-schtasks
status: experimental

logsource:
  product: windows
  service: sysmon
  category: process_creation

detection:

  selection_event:
    EventCode:
      - 1
      - 13

  selection_schtasks:
    Image|contains: "\\schtasks.exe"
    CommandLine|contains: "schtasks"

  condition: selection_event and selection_schtasks

fields:
  - EventCode
  - Image
  - CommandLine
  - alert_severity_id
