title: Enumeration with Systeminfo / Quser / Whoami / Hostname
id: pseudo-sigma-enum-4688
status: experimental

logsource:
  product: windows
  service: security
  category: process_creation

detection:
  selection_tools:
    Nom_du_processus|contains:
      - "SYSTEMINFO.EXE"
      - "QUSER.EXE"
      - "WHOAMI.EXE"
      - "HOSTNAME.EXE"

    Nom_du_nouveau_processus|contains:
      - "SYSTEMINFO.EXE"
      - "QUSER.EXE"
      - "WHOAMI.EXE"
      - "HOSTNAME.EXE"

  selection_event:
    EventCode: 4688

  condition: selection_event and selection_tools

fields:
  - Nom_du_processus
  - Nom_du_nouveau_processus
  - Nom_du_compte
  - Domaine_du_compte
  - EventCode
  - host
  - _time
