title: Suspicious DLL Load from Temp Directory
id: pseudo-sigma-dll-temp
status: experimental

logsource:
  product: windows
  service: sysmon
  category: image_load

detection:

  selection_event:
    EventCode: 7

  selection_imageloaded:
    ImageLoaded|contains: "\\temp\\"
    ImageLoaded|endswith: ".dll"

  selection_not_legit:
    Image|startswith: "C:\\Program Files"
    # negated later

  condition: selection_event and selection_imageloaded and not selection_not_legit

fields:
  - _time
  - Computer
  - Image
  - ImageLoaded
  - User
  - Hashes
  - ProcessGuid
  - ProcessId
  - ParentImage
